<?php return [
    'common' => [
        'hello' => 'Привіт, :firstname',
        'view_order_status_online' => 'Переглянути статус замовлення в Інтернеті',
        'view_order_in_backend' => 'Переглянути замовлення в серверній панелі магазину',
        'order_details' => 'Деталі замовлення',
    ],
    'payment' => [
        'refunded' => [
            'subject' => 'Ваш платіж повернуто',
            'message' => 'Ми щойно повернули плату за ваше замовлення **#:number**.',
            'duration' => 'Будь ласка, майте на увазі, що може знадобитися кілька днів, доки ви не отримаєте свої кошти.',
        ],
        'paid' => [
            'subject' => 'Дякуємо за платіж',
            'message' => 'Ми щойно отримали платіж за ваше замовлення **#:number**.',
            'process_order' => 'Тепер ми почнемо подальшу обробку замовлення.',
        ],
        'failed' => [
            'subject' => 'Не вдалося здійснити платіж за ваше замовлення',
            'message' => 'Ми просто хотіли повідомити, що платіж за замовлення **#:numbe** не вдався',
            'payment_advice' => 'Будь ласка, увійдіть у свій рахунок і спробуйте ще раз, щоб оплатити замовлення.',
            'support' => 'Якщо у вас і надалі виникають проблеми з платежами, зв\'яжіться з нами.',
        ],
    ],
    'order' => [
        'partials' => [
            'billing_address' => 'Адреса виставлення рахунку',
            'billing_and_shipping' => 'Адреса рахунку та доставки',
            'shipping_address' => 'Адреса доставки',
            'has_been_paid_on' => 'Замовлення було оплачено',
            'currently_pending' => 'Оплата за це замовлення наразі очікує на розгляд.',
            'track_shipping_status' => 'Ви можете відстежувати стан доставки вашого замовлення з такою інформацією:',
        ],
        'state_changed' => [
            'subject' => 'Статус вашого замовлення змінено',
            'message' => 'Ми просто хотіли повідомити вам, що ваше замовлення **#:number** оновлено до нового статусу: **:status**',
        ],
        'shipped' => [
            'subject' => 'Ваше замовлення відправлено',
            'message' => 'Ваше замовлення **#:number** було відправлено.',
        ],
    ],
    'customer' => [
        'created' => [
            'subject' => 'Ласкаво просимо до нашого магазину, :firstname',
            'confirm_mail' => 'Ласкаво просимо до нашого магазину! Будь ласка, натисніть на кнопку нижче, щоб підтвердити свою адресу електронної пошти. ',
            'message' => 'Ласкаво просимо до нашого магазину! Ви можете увійти, використовуючи свою електронну адресу **:email** і негайно розпочати покупки. ',
            'possibilities' => 'Ваш обліковий запис користувача дозволяє відстежувати відкриті та минулі замовлення.',
            'button' => [
                'confirm' => 'Підтвердьте свою адресу електронної пошти',
                'visit_store' => 'Відвідайте наш магазин',
            ],
        ],
    ],
    'checkout' => [
        'succeeded' => [
            'subject' => 'Підтвердження замовлення №: - номер',
            'thanks_for_order' => 'Щиро дякуємо за замовлення. Ми отримали таку інформацію ',
            'check_order_status' => 'Ви можете перевірити стан свого замовлення, відвідавши розділ облікового запису нашого магазину.',
        ],
        'failed' => [
            'subject' => 'Помилка оформлення замовлення №: - номер',
            'problem_message' => 'Нам дуже шкода, що під час вашого оформлення замовлення виникла проблема. Ми розглянемо проблему та зв’яжемося з вами для отримання додаткової інформації. ',
            'check_order_status' => 'Щоб перевірити статус вашого замовлення, ви можете будь-коли ввійти в наш магазин.',
            'payment_id' => 'Ідентифікатор платежу',
            'error' => 'Повідомлення про помилку',
        ],
    ],
    'admin' => [
        'checkout_succeeded' => [
            'subject' => 'Нове замовлення #:number',
            'order_placed' => 'У вашому магазині було розміщено таке замовлення:',
        ],
        'checkout_failed' => [
            'subject' => 'Помилка оформлення замовлення #:number',
            'not_processed' => 'Не вдалося правильно обробити наступне замовлення. Можливо, вам доведеться зв\'язатися із замовником. ',
            'error_details' => 'Деталі помилки',
        ],
    ],
];